{
  "shortText": "Jestem młodą osobą która, posiada pasję programowania. Mimo braku doświadczenia zawodowego mogę pochwalić się takimi cechami jak zawziętość, chęć podejmowania nowych wyzwań czy chęć do pracy w zespole. W przyszłości widzę siebie jako dobrego web developera, w tym celu stale poszerzam swoje umiejętności, które dają mi coraz większą pewność siebie.",
  "longText": "Moja przygoda z programowaniem zaczęła się w szkole średniej na lekcjach rozszerzonej informatyki, gdzie uczyliśmy się podstaw języka C++. Lekcje stawały się coraz trudniejsze a co za tym szło ciekawsze. Zacząłem się zastanawiać czy przypadkiem nie mógłbym robić tego zawodowo. Jednak od tego pomysłu odciągało mnie błędne spostrzeżenie zawodu programisty jako zawodu dla 'wybranych', mających najlepsze wyniki w szkołach, podczas kiedy nie byłem wybitnym uczniem a czas, który miałem poświęcić na przygotowanie się do testu wolałem spędzić kopiąc piłkę. Ostatecznie ukończyłem szkołę wraz z maturą i przyszedł czas zastanowić się co dalej? Na to pytanie nie potrafiłem sobie odpowiedzieć, ponieważ nigdy nie chciałem robić tego czego nie lubię. Krótkim, ale stosunkowo ważnym momentem była wspólna gra z kolegami w 'gta' podczas której zauważyłem pewne aspekty gry, które można by było zmienić lub ulepszyć. Szybko zacząłem przesiadywać więcej w edytorze kodu niż w samej grze próbując tworzyć modyfikacje na sesję jednoosobową. Wtedy wrócił pomysł sprzed kilku lat o rozpoczęciu pracy jako programista. Znalazłem w internecie oraz na kilku filmikach czy faktycznie ten cel jest realny. Informacje, które czytałem mówiły jasno, że zawód programisty nie jest dla wszystkich, jest dla ludzi zawziętych, wytrwałych oraz lubiących zmiany. Uznałem, że pasuję do tego opisu a po przeglądnięciu ofert pracy było ich dużo więcej niż się spodziewałem. Rozpocząłem naukę. Wybór kierunku, w którym podążałem padł na Front-end. Jako że podstawy HTML oraz CSS opanowałem w szkole rozpocząłem swój pierwszy kurs z zakresu JS. Po skończonym kursie miłym uczuciem była satysfakcja z podjętego wyboru. Przypadkiem oglądając filmik dotyczący React na youtubie, już wtedy postanowiłem wybrać React jako przyszły cel do osiągnięcia mimo tego, że moje umiejętności na tamten moment nie pozwalały na zagłębianie się we frameworki. Minęło około 7 miesięcy. Ukończyłem 3 kursy, HTML, CSS i JS. Zrealizowałem kilka hobbystycznych projektów takich jak warcaby czy snake. Poznałem narzędzia takie jak node.js, git, webpack czy preprocesor SASS. Nadszedł czas na wybranie frameworka, wybór tak jak wcześniej postanowiłem padł na React. W trakcie nauki frameworka poznałem również podstawy testowania swojego kodu, podstawy typescript oraz bibliotekę Redux."
}
